'use strict';

const express = require(`express`);
const request = require(`supertest`);

const {HttpCode} = require(`../../const`);
const category = require(`./category`);
const DataService = require(`../data-service/category`);

const mockData = [
  {
    "id": "pxB8Md",
    "title": "Как я стал программистом",
    "createdDate": "2021-10-07T16:03:30.163Z",
    "announce": [
      "Собрать камни бесконечности легко, если вы прирожденный герой.",
      "Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.",
      "Ёлки — это не просто красивое дерево. Это прочная древесина."
    ],
    "fullText": [
      "Достичь успеха помогут ежедневные повторения.",
      "Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.",
      "Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?",
      "Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.",
      "Это один из лучших рок-музыкантов.",
      "Из под его пера вышло 8 платиновых альбомов.",
      "Ёлки — это не просто красивое дерево. Это прочная древесина.",
      "Первая большая ёлка была установлена только в 1938 году.",
      "Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.",
      "Собрать камни бесконечности легко, если вы прирожденный герой.",
      "Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.",
      "О том, как я попал в IT.",
      "Золотое сечение — соотношение двух величин, гармоническая пропорция."
    ],
    "category": [
      "Без рамки",
      "Живопись",
      "Аксессуары"
    ],
    "comments": [
      {
        "id": "LCTTOe",
        "text": "Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Совсем немного... Это где ж такие красоты? Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы!"
      },
      {
        "id": "Uj9Z1m",
        "text": "Это где ж такие красоты? Плюсую, но слишком много буквы!"
      },
      {
        "id": "_-nM8I",
        "text": "Хочу такую же футболку :-) Мне кажется или я уже читал это где-то? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты? Плюсую, но слишком много буквы!"
      },
      {
        "id": "iSlB9u",
        "text": "Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Плюсую, но слишком много буквы! Это где ж такие красоты? Совсем немного... Хочу такую же футболку :-)"
      },
      {
        "id": "b--snu",
        "text": "Планируете записать видосик на эту тему Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы!"
      }
    ]
  },
  {
    "id": "iocLPJ",
    "title": "Как достигнуть успеха не вставая с кресла",
    "createdDate": "2021-08-06T16:03:30.163Z",
    "announce": [
      "Собрать камни бесконечности легко, если вы прирожденный герой.",
      "Он написал больше 30 хитов."
    ],
    "fullText": [
      "Из под его пера вышло 8 платиновых альбомов.",
      "Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.",
      "Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?",
      "Золотое сечение — соотношение двух величин, гармоническая пропорция.",
      "Как начать действовать? Для начала просто соберитесь."
    ],
    "category": [
      "Программирование",
      "Железо",
      "Живопись",
    ],
    "comments": [
      {
        "id": "2Gl5tx",
        "text": "Плюсую, но слишком много буквы! Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему"
      },
      {
        "id": "aabI3D",
        "text": "Плюсую, но слишком много буквы! Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Совсем немного... Хочу такую же футболку :-)"
      },
      {
        "id": "DOoYJ9",
        "text": "Мне кажется или я уже читал это где-то? Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Совсем немного... Это где ж такие красоты?"
      }
    ]
  }
];

const app = express();
app.use(express.json());

category(app, new DataService(mockData));

describe(`API returns category list`, () => {
  let response;

  beforeAll(async () => {
    response = await request(app)
      .get(`/categories`)
  });

  test(`Status code 200`, () => expect(response.statusCode).toBe(HttpCode.SUCCESS));
  test(`Returns list of all unique categories`, () => expect(response.body.length).toBe(5));
  test(`Correct category names`, () => expect(response.body).toEqual(
    expect.arrayContaining([`Программирование`, `Железо`, `Живопись`, `Без рамки`, `Аксессуары`])
  ));
});
