'use strict';

const express = require(`express`);
const request = require(`supertest`);

const {HttpCode} = require(`../../const`);
const search = require(`../api/search`);
const DataService = require(`../data-service/search`);

const mockData = [
  {
    "id": "VgDIRj",
    "title": "Как собрать камни бесконечности",
    "createdDate": "2021-10-09T15:08:35.754Z",
    "announce": [
      "Достичь успеха помогут ежедневные повторения.",
      "Простые ежедневные упражнения помогут достичь успеха.",
      "Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать."
    ],
    "fullText": [
      "Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.",
      "Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.",
      "Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.",
      "Программировать не настолько сложно, как об этом говорят.",
      "Вы можете достичь всего. Стоит только немного постараться и запастись книгами.",
      "Достичь успеха помогут ежедневные повторения.",
      "Как начать действовать? Для начала просто соберитесь."
    ],
    "category": [
      "Деревья",
      "Кино",
      "Аксессуары",
    ],
    "comments": [
      {
        "id": "NttB_L",
        "text": "Это где ж такие красоты?"
      },
      {
        "id": "PWrYAg",
        "text": "Это где ж такие красоты? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Плюсую, но слишком много буквы! Хочу такую же футболку :-) Мне кажется или я уже читал это где-то? Согласен с автором!"
      },
      {
        "id": "hWGegA",
        "text": "Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне кажется или я уже читал это где-то? Хочу такую же футболку :-) Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Совсем немного... Это где ж такие красоты? Плюсую, но слишком много буквы!"
      }
    ]
  },
  {
    "id": "zIJWgh",
    "title": "Учим HTML и CSS",
    "createdDate": "2021-09-08T15:08:35.754Z",
    "announce": [
      "Достичь успеха помогут ежедневные повторения.",
      "Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.",
    ],
    "fullText": [
      "Ёлки — это не просто красивое дерево. Это прочная древесина.",
      "Как начать действовать? Для начала просто соберитесь.",
      "Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?",
      "Программировать не настолько сложно, как об этом говорят.",
      "Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.",
    ],
    "category": [
      "Железо",
      "Книги",
      "Музыка",
      "Без рамки",
      "Одежда"
    ],
    "comments": [
      {
        "id": "2jpKoi",
        "text": "Согласен с автором! Планируете записать видосик на эту тему Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили."
      },
      {
        "id": "qgiHUp",
        "text": "Хочу такую же футболку :-) Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне кажется или я уже читал это где-то? Планируете записать видосик на эту тему Плюсую, но слишком много буквы! Согласен с автором! Совсем немного..."
      },
      {
        "id": "kZ88kw",
        "text": "Плюсую, но слишком много буквы! Мне кажется или я уже читал это где-то? Планируете записать видосик на эту тему"
      },
      {
        "id": "rDqiD4",
        "text": "Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы! Хочу такую же футболку :-) Планируете записать видосик на эту тему"
      }
    ]
  },
  {
    "id": "oLXYgD",
    "title": "Учим HTML и CSS",
    "createdDate": "2021-08-08T15:08:35.754Z",
    "announce": [
      "Золотое сечение — соотношение двух величин, гармоническая пропорция.",
      "Он написал больше 30 хитов.",
      "Из под его пера вышло 8 платиновых альбомов.",
      "Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.",
      "Первая большая ёлка была установлена только в 1938 году."
    ],
    "fullText": [
      "Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.",
      "О том, как я попал в IT.",
      "Достичь успеха помогут ежедневные повторения.",
      "Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?",
      "Вы можете достичь всего. Стоит только немного постараться и запастись книгами.",
      "Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много."
    ],
    "category": [
      "Техника",
      "Разное",
      "IT",
      "Книги",
      "Деревья"
    ],
    "comments": [
      {
        "id": "SZX0pN",
        "text": "Мне кажется или я уже читал это где-то? Согласен с автором! Плюсую, но слишком много буквы! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Совсем немного..."
      }
    ]
  },
  {
    "id": "ApUwU9",
    "title": "Как достигнуть успеха не вставая с кресла",
    "createdDate": "2021-11-03T15:08:35.754Z",
    "announce": [
      "Главное не перегорать, как в лампочке вольфрам...",
      "Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.",
      "Достичь успеха помогут ежедневные повторения.",
      "Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем."
    ],
    "fullText": [
      "Золотое сечение — соотношение двух величин, гармоническая пропорция.",
      "Это один из лучших рок-музыкантов.",
      "Собрать камни бесконечности легко, если вы прирожденный герой.",
      "О том, как я попал в IT.",
      "Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем."
    ],
    "category": [
      "За жизнь",
      "Железо",
      "Аксессуары"
    ],
    "comments": [
      {
        "id": "EEDoq4",
        "text": "Это где ж такие красоты? Согласен с автором! Хочу такую же футболку :-) Планируете записать видосик на эту тему Совсем немного... Давно не пользуюсь стационарными компьютерами. Ноутбуки победили."
      },
      {
        "id": "ezZxUC",
        "text": "Плюсую, но слишком много буквы! Это где ж такие красоты?"
      }
    ]
  }
];

const app = express();
app.use(express.json());

search(app, new DataService(mockData));

describe(`API returns article based on search query`, () => {
  let response;

  beforeAll(async () => {
    response = await request(app)
      .get(`/search`)
      .query({
        query: `Учим HTML и CSS`
      })
  });

  test(`Status code is 200`, () => expect(response.statusCode).toBe(HttpCode.SUCCESS));
  test(`Expected count of articles found`, () => expect(response.body.length).toBe(2));
  test(`First article has correct id`, () => expect(response.body[0].id).toBe(`zIJWgh`));
});

describe(`API returns errors for incorrect search queries`, () => {
  let notFoundResponse;
  let badRequestResponse;

  beforeAll(async () => {
    notFoundResponse = await request(app)
      .get(`/search`)
      .query({
        query: `Последний танец`
      })
  });

  beforeAll(async () => {
    badRequestResponse = await request(app)
      .get(`/search`)
  });

  test(`API returns code 404 if nothing is found`, () => expect(notFoundResponse.statusCode).toBe(HttpCode.NOT_FOUND));
  test(`Request with absent query`, () => expect(badRequestResponse.statusCode).toBe(HttpCode.BAD_REQUEST))
});
