// Запрос на получение списка всех категорий
SELECT *
FROM CATEGORIES

// Запрос на получение списка категорий, для которых создана минимум одна публикация (идентификатор, наименование категории)
SELECT *
FROM CATEGORIES CAT
JOIN ARTICLE_CATEGORIES AC ON CAT.ID = AC.CATEGORY_ID

// Запрос на получение списка категорий с количеством публикаций (идентификатор, наименование категории, количество публикаций в категории)
SELECT CAT.NAME AS "Имя категории",
	COUNT(AC.ARTICLE_ID) AS "Кол-во публикаций"
FROM CATEGORIES CAT
JOIN ARTICLE_CATEGORIES AC ON CAT.ID = AC.CATEGORY_ID
GROUP BY CAT.NAME

// Запрос на получение списка публикаций (идентификатор публикации, заголовок публикации, анонс публикации, дата публикации, имя и фамилия автора, контактный email, количество комментариев, наименование категорий). Сначала свежие публикации


// Запрос на получение полной информации определённой публикации (идентификатор публикации, заголовок публикации, анонс, полный текст публикации, дата публикации, путь к изображению, имя и фамилия автора, контактный email, количество комментариев, наименование категорий)


// Запрос на получение списка из 5 свежих комментариев (идентификатор комментария, идентификатор публикации, имя и фамилия автора, текст комментария)


// Запрос на получение списка комментариев для определённой публикации (идентификатор комментария, идентификатор публикации, имя и фамилия автора, текст комментария). Сначала новые комментарии
SELECT CM.ID AS "ID комментария",
	CM.ARTICLE_ID AS "ID публикации",
	US.NAME || ' ' || US.LASTNAME AS "Имя и фамилия автора",
	CM.TEXT AS "Текст комментария"
FROM COMMENTS CM
JOIN USERS US ON CM.USER_ID = US.ID
WHERE CM.ARTICLE_ID = 3
ORDER BY CM.CREATEDDATE DESC

// Запрос на обновление заголовка определённой публикации на «Как я встретил Новый год»
UPDATE ARTICLES
SET TITLE = 'Как я встретил Новый год'
WHERE ID = 2
