// Запрос на получение списка всех категорий
select * from categories

// Запрос на получение списка категорий, для которых создана минимум одна публикация (идентификатор, наименование категории)
select * from categories cat join article_categories ac on cat.id = ac.category_id

// Запрос на получение списка категорий с количеством публикаций (идентификатор, наименование категории, количество публикаций в категории)


// Запрос на получение списка публикаций (идентификатор публикации, заголовок публикации, анонс публикации, дата публикации, имя и фамилия автора, контактный email, количество комментариев, наименование категорий). Сначала свежие публикации


// Запрос на получение полной информации определённой публикации (идентификатор публикации, заголовок публикации, анонс, полный текст публикации, дата публикации, путь к изображению, имя и фамилия автора, контактный email, количество комментариев, наименование категорий)


// Запрос на получение списка из 5 свежих комментариев (идентификатор комментария, идентификатор публикации, имя и фамилия автора, текст комментария)


// Запрос на получение списка комментариев для определённой публикации (идентификатор комментария, идентификатор публикации, имя и фамилия автора, текст комментария). Сначала новые комментарии


// Запрос на обновление заголовка определённой публикации на «Как я встретил Новый год»

